#include<iostream>
using namespace std;
/*
逻辑运算符
	与 && (全真才是真)
	或 || (有一个真则为真)
	非 !  (!0 = 1 , !1 = 0)
	优先级 :  || < && < !

	常见运算符优先级从高到低排列
	简称  含义         运算符					运算对象个数		结合方向
1   单    单目运算符   ++, --, !, -				单目运算符			从右至左
2	算    算数运算符   *, /, %					双目运算符			从左至右
3	关    关系运算符   >, >=, <, <=, ==, != 	双目运算符			从左至右
4	逻    逻辑运算符   &&, || 					双目运算符			从左至右
5	条	  条件运算符   ?, :						三目运算符			从右至左
6	赋    赋值运算符   =, +=, -=, *=, /=, %=	双目运算符			从右至左
7	逗    逗号运算符   ,											从左至右

单算关逻条赋逗
*/
int main() {
	return 0;
}