#include<iostream>
using namespace std;
//异或运算符  ^
int main() {
	//1、异或的定义
	int a = 0b1010;
	int b = 0b0110;
	// ^ = 0b1100
	cout << (a ^ b) << endl;//从两个数的二进制数的最低位逐渐向最高位开始比较，如果相等就等于1，否则等于0
	//任何数和0异或结果还是他本身
	//两个相同的数异或结果是0
	//异或满足交换律和结合律
	//异或的本质是不带进位的二进制加法

	//2、标记位取反
	int c = 0b1000101;
	cout << (c ^ 0b1000) << endl;//将倒数第四位通过与0b1000异或得到取反，此处根据定义，相同则为0 不同则为1

	//3、变量交换
	int d = 17;
	int e = 19;
	d = d ^ e;//此时d不再是d，变成了d' = d ^ e
	e = e ^ d;//拆分此处e = e ^ d' ->  e = e ^ (d ^ e) 根据结合律 e = d ^ e ^ e 此处e和e异或为0，d和0异或变成d 所以e = d;
	d = d ^ e;//此处d是d'-> d' = d' ^ e ^ d' = e ^ 0 = e 所以此处d = e

	//4、出现奇数次的数
	int arr[] = { 1,3,1,3,4,5,5 };
	int sum = 0;
	for (int i = 0; i < 7; ++i) {
		sum = sum ^ arr[i];
	}
	cout << sum << endl;//输出4，因为4出现的次数只有一次是奇数次，原理在于和相同的数字异或会变为0，出现偶数次的数都会和另一个相同的数字异或一次变为0
	//5、加密
	int x = 1314;
	int y = (x ^ 3135);
	cout << (y ^ 3135) << endl;//密码是3135  用输入3135之后把这个数字和x^3135异或  会得到x本身
	return 0;
}