#include <iostream>
using namespace std;
//一维数组
int main()
{
    //1.一维数组的定义
    int a[1024];
    double b[1024];
    char c[520];//一个数组里面的元素类型是相同的，数组下标从0开始，对于数组a可以访问从a[0]到a[1023]的元素。
    //数组的定义里面数字必须是常量不能是变量，例如b[n]这样的定义是错误的。
    //2.数组元素的访问
    //数组名[下标]
    a[0] = 1;
    a[1023] = 2;
    cout << a[0] << " " << a[1023] << ' ' << a[2] << endl;//输出1 2 乱码，因为a[2]没有初始化
    int f[10] = { 0 };//初始化数组
    //3.逆序输出数组
    for (int e = 0; e < 10; ++e) {
        f[e] = e;
    }
    for (int i = 9; i > -1; --i) {
        cout << f[i] << " ";//输出9 8 7 6 5 4 3 2 1 0，逆序输出
    }
    return 0;
}