#include <iostream>
using namespace std;
//指针数组
int main() {
	int mat[3][4] = {
		{1, 2, 3, 4},
		{5, 6, 7, 8},
		{9, 10, 11, 12}
	};
	int* pmat[3];//二维数组有几行，指针数组就有几个元素
	for (int i = 0; i < 3; i++) {
		pmat[i] = mat[i];//把二维数组的每一行的首地址传给指针数组的元素，这样每个指针元素就可以指向一个一维数组的首元素的地址
	}
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 4; j++) {
			//通过指针数组的元素，可以直接访问二维数组的元素
			cout << *(pmat[i] + j) << " ";//pmat[]其中[]里面的数值i对应着数组的第几行，j代表的是数组的第几列，*取其中的房屋内的值，也就是二维数组的元素值，如果不加*，则输出的是二维数组的各个元素的地址
		}
		cout << endl;
	}
	return 0;
}